In [1]:
import pandas as pd

In [2]:
df_train= pd.read_csv('train.csv')
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df_test=pd.read_csv('test.csv')
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
numeric_columns= list(df_train.select_dtypes(exclude='object'))
numeric_columns

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [6]:
numeric_columns.remove('PassengerId')
numeric_columns

['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [7]:
object_columns= list(df_train.select_dtypes(include='object'))
object_columns

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [8]:
df_train['Age'].fillna(value=df_train['Age'].median(), inplace= True)

In [9]:
df_train[numeric_columns].isna().sum()

Survived    0
Pclass      0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

In [10]:
df_train['Embarked'].fillna(value=df_train['Embarked'].mode()[0], inplace= True)

In [11]:
df_train[object_columns].isna().sum()

Name          0
Sex           0
Ticket        0
Cabin       687
Embarked      0
dtype: int64

In [ ]:
#numeric_columns.remove('Survived')
#numeric_columns

In [12]:
object_columns.remove('Ticket')

In [13]:
object_columns.remove('Cabin')
object_columns

['Name', 'Sex', 'Embarked']

In [ ]:
#Sex_enc= df_train['Sex'].apply(lambda x: 0 if x=='Male' else 1)
#Sex_enc

In [ ]:
#object_columns.remove('Sex')

In [ ]:
#df_train_final=pd.concat([df_train[numeric_columns],Sex_enc], axis=1)

In [ ]:
#df_train_final.columns

In [14]:
object_columns.remove('Embarked')

In [15]:
df_train['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [16]:
Emb_enc= pd.get_dummies(data=df_train['Embarked'], prefix='Emb')

In [ ]:
#Emb_enc

In [17]:
df_train_final=pd.concat([df_train[numeric_columns],Emb_enc], axis=1)

In [18]:
Enc_sex= pd.get_dummies(data=df_train['Sex'], prefix='Sex')

In [19]:
df_train_final=pd.concat([df_train_final,Enc_sex], axis=1)

In [20]:
df_train_final.columns

Index(['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Emb_C', 'Emb_Q',
       'Emb_S', 'Sex_female', 'Sex_male'],
      dtype='object')

In [22]:
#titles=df_train['Name'].apply(lambda X: X.split(',')[1].split('.')[0])

In [23]:
#titles.value_counts()

 Mr              517
 Miss            182
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Col               2
 Mlle              2
 Major             2
 the Countess      1
 Sir               1
 Mme               1
 Jonkheer          1
 Capt              1
 Don               1
 Lady              1
 Ms                1
Name: Name, dtype: int64

In [28]:
def get_title(x):
    titles= x.split(' ')[1]
    if not titles in ['Mr.','Miss.','Mrs.','Master.','Dr.','Rev.']:
        titles='other'
    return titles

In [29]:
#df_train['Name'].apply(get_title).value_counts()

Mr.        502
Miss.      179
Mrs.       121
Master.     40
other       36
Dr.          7
Rev.         6
Name: Name, dtype: int64

In [30]:
df_train['Title']=df_train['Name'].apply(get_title)

In [31]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr.
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs.
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss.
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs.
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr.

In [34]:
enc_title_train=pd.get_dummies(df_train['Title'], prefix='Title')

In [35]:
df_train_final=pd.concat([df_train_final,enc_title_train], axis=1)

In [38]:
X_train= df_train_final.drop('Survived',axis=1)
y_train= df_train['Survived']

In [39]:
X_train.columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Emb_C', 'Emb_Q', 'Emb_S',
       'Sex_female', 'Sex_male', 'Title_Dr.', 'Title_Master.', 'Title_Miss.',
       'Title_Mr.', 'Title_Mrs.', 'Title_Rev.', 'Title_other'],
      dtype='object')

In [40]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [41]:
numeric_columns_test= list(df_test.select_dtypes(exclude='object'))
numeric_columns_test

['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [42]:
numeric_columns_test.remove('PassengerId')
numeric_columns_test

['Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [43]:
object_columns_test= list(df_test.select_dtypes(include='object'))
object_columns_test

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [45]:
object_columns_test.remove('Ticket')
object_columns_test.remove('Cabin')
object_columns_test

['Name', 'Sex', 'Embarked']

In [46]:
df_test['Age'].fillna(value=df_test['Age'].median(), inplace= True)

In [47]:
df_test[numeric_columns_test].isna().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
Fare      1
dtype: int64

In [48]:
df_test['Fare'].value_counts()

7.7500     21
26.0000    19
8.0500     17
13.0000    17
7.8958     11
           ..
9.3250      1
14.4583     1
15.0333     1
25.4667     1
21.0750     1
Name: Fare, Length: 169, dtype: int64

In [49]:
df_test['Fare'].fillna(value=df_test['Fare'].median(), inplace= True)

In [56]:
#df_test['Name'].apply(get_title).value_counts()

Mr.        234
Miss.       77
Mrs.        70
Master.     19
other       15
Rev.         2
Dr.          1
Name: Name, dtype: int64

In [ ]:
#Sex_enc_test= df_test['Sex'].apply(lambda x: 0 if x=='Male' else 1)
#Sex_enc_test

In [ ]:
#numeric_columns_test.remove('Sex')

In [ ]:
#df_test_final=pd.concat([df_test[numeric_columns_test],Sex_enc_test], axis=1)

In [50]:
object_columns_test.remove('Embarked')

In [51]:
Emb_enc_test= pd.get_dummies(data=df_test['Embarked'], prefix='Emb')

In [52]:
df_test_final=pd.concat([df_test[numeric_columns_test],Emb_enc_test], axis=1)

In [53]:
Enc_sex_test= pd.get_dummies(data=df_test['Sex'], prefix='Sex')

In [54]:
df_test_final=pd.concat([df_test_final,Enc_sex_test], axis=1)

In [55]:
df_test_final

,Pclass,Age,SibSp,Parch,Fare,Emb_C,Emb_Q,Emb_S,Sex_female,Sex_male
0,3,34.5,0,0,7.8292,0,1,0,0,1
1,3,47.0,1,0,7.0000,0,0,1,1,0
2,2,62.0,0,0,9.6875,0,1,0,0,1
3,3,27.0,0,0,8.6625,0,0,1,0,1
4,3,22.0,1,1,12.2875,0,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...
413,3,27.0,0,0,8.0500,0,0,1,0,1
414,1,39.0,0,0,108.9000,1,0,0,1,0
415,3,38.5,0,0,7.2500,0,0,1,0,1
416,3,27.0,0,0,8.0500,0,0,1,0,1
417,3,27.0,1,1,22.3583,1,0,0,0,1

In [58]:
df_test['Title']=df_test['Name'].apply(get_title)

In [59]:
enc_title_test=pd.get_dummies(df_test['Title'], prefix='Title')

In [60]:
df_test_final=pd.concat([df_test_final,enc_title_test], axis=1)

In [61]:
X_test= df_test_final

In [62]:
X_test.columns

Index(['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Emb_C', 'Emb_Q', 'Emb_S',
       'Sex_female', 'Sex_male', 'Title_Dr.', 'Title_Master.', 'Title_Miss.',
       'Title_Mr.', 'Title_Mrs.', 'Title_Rev.', 'Title_other'],
      dtype='object')

In [63]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
X_train.info()

In [64]:
model= RandomForestClassifier(n_estimators=80, max_depth=5, random_state=34)
model.fit(X_train, y_train)

RandomForestClassifier(max_depth=5, n_estimators=80, random_state=34)

In [ ]:
X_test.info()

In [65]:
y_pred= model.predict(X_test)

In [66]:
y_pred.shape

(418,)

In [67]:
df_submit=pd.DataFrame({'PassengerId':df_test['PassengerId'], 'Survived': y_pred})

In [68]:
df_submit.to_csv('submission4.csv', index=False)

In [ ]:
#from xgboost import XGBClassifier

In [ ]:
#xg_model= XGBClassifier(random_state= 34)

In [ ]:
#xg_model.fit(X_train, y_train)

In [ ]:
#y_pred= xg_model.predict(X_test)

In [ ]:
#df_submit=pd.DataFrame({'PassengerId':df_test['PassengerId'], 'Survived': y_pred})

In [ ]:
#df_submit.to_csv('submission3.csv', index=False)